In [70]:
# 1
#Given a sample list, tuple and a set with elements as numbers from 1-10. 
#Convert each of the data types into a pandas series. 
#Create a separate list of index values for the series.

In [1]:
import pandas as pd
list1 = [1,2,3,4,5,6,7,8,9,10]
tup1  = (1,2,3,4,5,6,7,8,9,10)
set1 = {1,2,3,4,5,6,7,8,9,10}

series1 = pd.Series(list1, index = ['a','b','c','d','e','f','g','h','i','j'])
series2 = pd.Series(tup1,index = ['a','b','c','d','e','f','g','h','i','j'])
#series3 = pd.Series(set1)

In [3]:
series2

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [3]:
s3=pd.Series(set1)

TypeError: 'set' type is unordered

In [4]:
# 2. Create a python dictionary with three key value pairs.
#Keep the keys as the first names, and the respective last names as values in the dictionary.
#Use the dictionary to create a pandas series.

In [5]:
dict1 = {"fname":"Rajesh","mname":"Kumar","lname":"Verma"}

In [6]:
dict1

{'fname': 'Rajesh', 'mname': 'Kumar', 'lname': 'Verma'}

In [7]:
series1 = pd.Series(dict1)

In [8]:
series1

fname    Rajesh
mname     Kumar
lname     Verma
dtype: object

In [9]:
3. #Create a pandas series, with the elements as numbers from 1-10. Use the index values starting from 0-10. For the above series:
#Convert it to a list.
#Convert it to a dictionary.
#Convert it to a tuple.
#Convert it to a set

3.0

In [7]:
series1 = pd.Series(range(1,11))
series1

a    1
b    2
d    3
c    4
e    5
dtype: int64

In [11]:
list1 = list(series1)
print(list1)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [12]:
dict1 = dict(series1)
print(dict1)

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [13]:
tup1 = tuple(series1)
tup1

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [14]:
set1 = set(series1)

In [15]:
set1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [16]:
 """ 4. Create a sample pandas series with x integer elements. Perform the following operations on the same:
Print the first 5 elements of the series
Print the last 5 elements of the series
Insert an integer value ‘50’ at the index 5.
Update the last element in the series with the value 100.
Delete the first element from the series.
"""

' 4. Create a sample pandas series with x integer elements. Perform the following operations on the same:\nPrint the first 5 elements of the series\nPrint the last 5 elements of the series\nInsert an integer value ‘50’ at the index 5.\nUpdate the last element in the series with the value 100.\nDelete the first element from the series.\n'

In [11]:
series1 = pd.Series([1,2,3,4,5,6,7,8,9,10])
print(series1[0:5])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
print(series1[-5:])

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [14]:
series1[0]

1

In [15]:
list1 = list(series1)
list1.insert(5, 50)
series2 = pd.Series(list1)
print(series2)

0     1
1     2
2     3
3     4
4     5
5    50
dtype: int64

In [17]:
series2[5] = 100
print(series2)
type(series2)

0      1
1      2
2      3
3      4
4      5
5    100
dtype: int64

pandas.core.series.Series

In [18]:
series2 = series2.drop(0)
print(series2)

1      2
2      3
3      4
4      5
5    100
dtype: int64

In [22]:
#5. For a given pandas series obtained in the 4th step. Write a sample code to find the element 100 in the series.

In [35]:
for i in series2:
    if i == 3:
        print("yes we have element 100")

yes we have element 100

In [29]:
#6.For the given series A and B, perform concatenation on the same. 
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [25]:
pd.concat((series_A,series_B))

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [26]:
#7.
# Using loops in python, print all the elements within a pandas series. 
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [27]:
# 8.
#For a given nested list and a sample dictionary, create two data frames using pandas. 
#List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
#Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [37]:
List1 = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary1 = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}
df1 = pd.DataFrame(List1,columns=['A','B','C'])
df2 = pd.DataFrame(Dictionary1)

In [38]:
print(df1)

    A   B   C
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [30]:
print(df2)

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [31]:
#9.
#Create a pandas Dataframe  with two columns = [‘Name’, ‘Age’]. Perform the following operations on the same. 
#Insert 5 imaginary names and ages as values to the pandas Data Frame . 
#Print the first 3 rows of the Data Frame .
#Print the rows that have the age greater than 15.
#Update the 5th row so that the name = john and age=56. 
#Delete the first row from the Data Frame .

In [72]:

df1 = pd.DataFrame(data, columns=['Name','Age'])
data = [['tom', 10], ['nick', 15], ['juli', 14],['rahul',50],['joy',38]]
df1

    Name  Age
0    tom   10
1   nick   15
2   juli   14
3  rahul   50
4    joy   38

In [33]:
#df1.shape

In [34]:
df1.iloc[0:3,:]

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [35]:
df1[df1['Age']>15]

    Name  Age
3  rahul   50
4    joy   38

In [36]:
df1

    Name  Age
0    tom   10
1   nick   15
2   juli   14
3  rahul   50
4    joy   38

In [37]:
df1.loc[4,'Name']='John'
df1.loc[4,'Age']=50

In [38]:
df1

    Name  Age
0    tom   10
1   nick   15
2   juli   14
3  rahul   50
4   John   50

In [39]:
df1.drop(0)

    Name  Age
1   nick   15
2   juli   14
3  rahul   50
4   John   50

In [40]:
# 10.
#For the Data Frame obtained from step 9, convert the same to a list and a dictionary respectively

In [74]:
l1=list(df1.values)
l1

[array(['tom', 10], dtype=object),
 array(['nick', 15], dtype=object),
 array(['juli', 14], dtype=object),
 array(['rahul', 50], dtype=object),
 array(['joy', 38], dtype=object)]

In [75]:
di1 = dict(df1.values)

In [76]:
di1

{'tom': 10, 'nick': 15, 'juli': 14, 'rahul': 50, 'joy': 38}

In [77]:
# 11
""" . Create two separate Data Frames A and B, and perform the following operations on them. 
Concatenate the two Data Frames to a new Data Frame  C. 
Split the Data Frame  C row wise. 
Split the Data Frame column wise based on a condition. For example - columns values greater than 10, column values less than 10, etc
"""

' . Create two separate Data Frames A and B, and perform the following operations on them. \nConcatenate the two Data Frames to a new Data Frame  C. \nSplit the Data Frame  C row wise. \nSplit the Data Frame column wise based on a condition. For example - columns values greater than 10, column values less than 10, etc\n'

In [39]:
A = pd.DataFrame([1,2,3,4,5])
B = pd.DataFrame([11,12,13,14,15])

In [40]:
C = pd.concat([A,B],ignore_index=True )

In [41]:
print(C)

    0
0   1
1   2
2   3
3   4
4   5
5  11
6  12
7  13
8  14
9  15

In [42]:
# splitting dataframe by row index
df_1 = C.iloc[:4,:]
df_2 = C.iloc[4:,:]

In [43]:
print(df_1)

   0
0  1
1  2
2  3
3  4

In [44]:
print(df_2)

    0
4   5
5  11
6  12
7  13
8  14
9  15

In [59]:
#column wise - Home Task

df_10l=C.iloc[list(C[0]>10)]

In [60]:
df_10l

    0
5  11
6  12
7  13
8  14
9  15

In [51]:
df3 = pd.DataFrame.from_dict(
    {
        'Name': ['Jenny', 'Matt', 'Kristen', 'Jenny', 'Matt', 'Kristen', 'Jenny', 'Matt', 'Kristen', 'Jenny', 'Matt', 'Kristen'],
        'Year': [2020, 2021, 2022, 2020, 2021, 2022, 2020, 2021, 2022, 2020, 2021, 2022],
        'Income': [10000, 11000, 9000, 12000, 13000, 11000, 14000, 15000, 13000, 12000, 14000, 13000],
        'Gender': ['F', 'M', 'F', 'F', 'M', 'F', 'F', 'M', 'F', 'F', 'M', 'F']
    }
)

In [53]:
grouped = df3.groupby(df3['Name'])
print(grouped.get_group('Jenny'))

    Name  Year  Income Gender
0  Jenny  2020   10000      F
3  Jenny  2020   12000      F
6  Jenny  2020   14000      F
9  Jenny  2020   12000      F

In [71]:
# 12

"""Create a Data Frame with columns Name and Age. Perform the following operations.
Write a sample code to search for the Name/Names where Age is 20. 
Sort the Data Frame in ascending order of ages. 
Using Python loops, print the ages from the data frame and store it in a set.
"""

'Create a Data Frame with columns Name and Age. Perform the following operations.\nWrite a sample code to search for the Name/Names where Age is 20. \nSort the Data Frame in ascending order of ages. \nUsing Python loops, print the ages from the data frame and store it in a set.\n'

In [61]:
df4 = pd.DataFrame(
    {
        'Name': ['Jenny', 'Matt', 'Kristen', 'Phany', 'Matt', 'Kristen', 'John', 'Matt', 'Kristen', 'Jenny', 'Matt', 'Kristen'],
        'Age': [20, 21, 32, 20, 71, 98, 10, 17, 13, 74, 120, 34],
        'Gender': ['F', 'M', 'F', 'F', 'M', 'F', 'F', 'M', 'F', 'F', 'M', 'F']
    }
)

In [62]:
df4

       Name  Age Gender
0     Jenny   20      F
1      Matt   21      M
2   Kristen   32      F
3     Phany   20      F
4      Matt   71      M
5   Kristen   98      F
6      John   10      F
7      Matt   17      M
8   Kristen   13      F
9     Jenny   74      F
10     Matt  120      M
11  Kristen   34      F

In [63]:
df4[df4['Age']==20]

    Name  Age Gender
0  Jenny   20      F
3  Phany   20      F

In [64]:
df4.sort_values(by='Age')

       Name  Age Gender
6      John   10      F
8   Kristen   13      F
7      Matt   17      M
0     Jenny   20      F
3     Phany   20      F
1      Matt   21      M
2   Kristen   32      F
11  Kristen   34      F
4      Matt   71      M
9     Jenny   74      F
5   Kristen   98      F
10     Matt  120      M

In [66]:
df4['Age']

0      20
1      21
2      32
3      20
4      71
5      98
6      10
7      17
8      13
9      74
10    120
11     34
Name: Age, dtype: int64

In [83]:
l=[]
for i in range(len(df4)):
    l.append(df4.loc[i,'Age'])
set1=set(l)
print(set1)

{32, 98, 34, 71, 10, 74, 13, 17, 20, 21, 120}